import React from 'react';
import ReactApexChart from 'react-apexcharts';


const MarketArray=({DataOne,DataTwo,DataThree,DataFour,DataFive,time})=>{
    // function generateDayWiseTimeSeries(baseval, count, yrange) {
    //     var i = 0;
    //     var series = [];
    //     while (i < count) {
    //       var x = baseval;
    //       var y =
    //         Math.floor(Math.random() * (yrange.max - yrange.min + 1)) + yrange.min;
      
    //       series.push([x, y]);
    //       baseval += 86400000;
    //       i++;
    //     }
    //     return series;
    //   }
        const series= [
            // DataOne,DataTwo,DataThree,DataFour,DataFive
            [
                {
                    "name": "بیشتر از 3 درصد منفی",
                    "data": [
                        [
                            "09:05:07",
                            28
                        ],
                        [
                            "09:10:07",
                            31
                        ],
                        [
                            "09:15:07",
                            32
                        ],
                        [
                            "09:20:07",
                            37
                        ],
                        [
                            "09:25:08",
                            38
                        ],
                        [
                            "09:30:07",
                            36
                        ],
                        [
                            "09:35:06",
                            33
                        ],
                        [
                            "09:40:06",
                            34
                        ],
                        [
                            "09:45:08",
                            33
                        ],
                        [
                            "09:50:08",
                            33
                        ],
                        [
                            "09:55:10",
                            36
                        ],
                        [
                            "10:00:08",
                            38
                        ],
                        [
                            "10:05:08",
                            36
                        ],
                        [
                            "10:10:09",
                            40
                        ],
                        [
                            "10:15:10",
                            39
                        ],
                        [
                            "10:20:11",
                            39
                        ],
                        [
                            "10:25:11",
                            38
                        ],
                        [
                            "10:30:11",
                            39
                        ],
                        [
                            "10:35:11",
                            37
                        ],
                        [
                            "10:40:11",
                            42
                        ],
                        [
                            "10:45:10",
                            41
                        ],
                        [
                            "10:50:10",
                            39
                        ],
                        [
                            "10:55:14",
                            38
                        ],
                        [
                            "11:00:11",
                            0
                        ],
                        [
                            "11:05:24",
                            43
                        ],
                        [
                            "11:10:09",
                            47
                        ],
                        [
                            "11:15:10",
                            46
                        ],
                        [
                            "11:20:10",
                            41
                        ],
                        [
                            "11:25:12",
                            47
                        ],
                        [
                            "11:30:12",
                            47
                        ],
                        [
                            "11:35:10",
                            50
                        ],
                        [
                            "11:40:12",
                            49
                        ],
                        [
                            "11:45:11",
                            50
                        ],
                        [
                            "11:50:17",
                            48
                        ],
                        [
                            "11:55:10",
                            55
                        ],
                        [
                            "12:00:10",
                            53
                        ],
                        [
                            "12:05:13",
                            55
                        ],
                        [
                            "12:10:11",
                            57
                        ],
                        [
                            "12:15:14",
                            55
                        ],
                        [
                            "12:20:11",
                            55
                        ],
                        [
                            "12:25:17",
                            56
                        ],
                        [
                            "12:30:10",
                            64
                        ],
                        [
                            "12:35:11",
                            63
                        ],
                        [
                            "12:40:15",
                            62
                        ],
                        [
                            "12:45:14",
                            62
                        ],
                        [
                            "12:50:12",
                            62
                        ],
                        [
                            "12:55:07",
                            62
                        ]
                    ]
                },
                {
                    "name": "بین 0.5 تا 3 درصد منفی",
                    "data": [
                        [
                            "09:05:07",
                            267
                        ],
                        [
                            "09:10:07",
                            261
                        ],
                        [
                            "09:15:07",
                            265
                        ],
                        [
                            "09:20:07",
                            259
                        ],
                        [
                            "09:25:08",
                            264
                        ],
                        [
                            "09:30:07",
                            277
                        ],
                        [
                            "09:35:06",
                            268
                        ],
                        [
                            "09:40:06",
                            281
                        ],
                        [
                            "09:45:08",
                            291
                        ],
                        [
                            "09:50:08",
                            295
                        ],
                        [
                            "09:55:10",
                            309
                        ],
                        [
                            "10:00:08",
                            310
                        ],
                        [
                            "10:05:08",
                            310
                        ],
                        [
                            "10:10:09",
                            310
                        ],
                        [
                            "10:15:10",
                            308
                        ],
                        [
                            "10:20:11",
                            309
                        ],
                        [
                            "10:25:11",
                            307
                        ],
                        [
                            "10:30:11",
                            308
                        ],
                        [
                            "10:35:11",
                            312
                        ],
                        [
                            "10:40:11",
                            306
                        ],
                        [
                            "10:45:10",
                            308
                        ],
                        [
                            "10:50:10",
                            302
                        ],
                        [
                            "10:55:14",
                            312
                        ],
                        [
                            "11:00:11",
                            0
                        ],
                        [
                            "11:05:24",
                            329
                        ],
                        [
                            "11:10:09",
                            325
                        ],
                        [
                            "11:15:10",
                            338
                        ],
                        [
                            "11:20:10",
                            340
                        ],
                        [
                            "11:25:12",
                            336
                        ],
                        [
                            "11:30:12",
                            351
                        ],
                        [
                            "11:35:10",
                            355
                        ],
                        [
                            "11:40:12",
                            350
                        ],
                        [
                            "11:45:11",
                            357
                        ],
                        [
                            "11:50:17",
                            358
                        ],
                        [
                            "11:55:10",
                            359
                        ],
                        [
                            "12:00:10",
                            368
                        ],
                        [
                            "12:05:13",
                            365
                        ],
                        [
                            "12:10:11",
                            372
                        ],
                        [
                            "12:15:14",
                            374
                        ],
                        [
                            "12:20:11",
                            371
                        ],
                        [
                            "12:25:17",
                            368
                        ],
                        [
                            "12:30:10",
                            354
                        ],
                        [
                            "12:35:11",
                            346
                        ],
                        [
                            "12:40:15",
                            335
                        ],
                        [
                            "12:45:14",
                            336
                        ],
                        [
                            "12:50:12",
                            337
                        ],
                        [
                            "12:55:07",
                            337
                        ]
                    ]
                },
                {
                    "name": "بین منفی 0.5 تا مثبت 0.5",
                    "data": [
                        [
                            "09:05:07",
                            586
                        ],
                        [
                            "09:10:07",
                            589
                        ],
                        [
                            "09:15:07",
                            596
                        ],
                        [
                            "09:20:07",
                            604
                        ],
                        [
                            "09:25:08",
                            593
                        ],
                        [
                            "09:30:07",
                            581
                        ],
                        [
                            "09:35:06",
                            592
                        ],
                        [
                            "09:40:06",
                            580
                        ],
                        [
                            "09:45:08",
                            578
                        ],
                        [
                            "09:50:08",
                            590
                        ],
                        [
                            "09:55:10",
                            573
                        ],
                        [
                            "10:00:08",
                            578
                        ],
                        [
                            "10:05:08",
                            583
                        ],
                        [
                            "10:10:09",
                            580
                        ],
                        [
                            "10:15:10",
                            593
                        ],
                        [
                            "10:20:11",
                            590
                        ],
                        [
                            "10:25:11",
                            583
                        ],
                        [
                            "10:30:11",
                            583
                        ],
                        [
                            "10:35:11",
                            581
                        ],
                        [
                            "10:40:11",
                            574
                        ],
                        [
                            "10:45:10",
                            572
                        ],
                        [
                            "10:50:10",
                            575
                        ],
                        [
                            "10:55:14",
                            581
                        ],
                        [
                            "11:00:11",
                            0
                        ],
                        [
                            "11:05:24",
                            566
                        ],
                        [
                            "11:10:09",
                            583
                        ],
                        [
                            "11:15:10",
                            570
                        ],
                        [
                            "11:20:10",
                            560
                        ],
                        [
                            "11:25:12",
                            566
                        ],
                        [
                            "11:30:12",
                            553
                        ],
                        [
                            "11:35:10",
                            553
                        ],
                        [
                            "11:40:12",
                            553
                        ],
                        [
                            "11:45:11",
                            547
                        ],
                        [
                            "11:50:17",
                            541
                        ],
                        [
                            "11:55:10",
                            535
                        ],
                        [
                            "12:00:10",
                            533
                        ],
                        [
                            "12:05:13",
                            538
                        ],
                        [
                            "12:10:11",
                            535
                        ],
                        [
                            "12:15:14",
                            535
                        ],
                        [
                            "12:20:11",
                            544
                        ],
                        [
                            "12:25:17",
                            540
                        ],
                        [
                            "12:30:10",
                            548
                        ],
                        [
                            "12:35:11",
                            547
                        ],
                        [
                            "12:40:15",
                            548
                        ],
                        [
                            "12:45:14",
                            548
                        ],
                        [
                            "12:50:12",
                            546
                        ],
                        [
                            "12:55:07",
                            546
                        ]
                    ]
                },
                {
                    "name": "بین 0.5 تا 3 درصد مثبت",
                    "data": [
                        [
                            "09:05:07",
                            155
                        ],
                        [
                            "09:10:07",
                            158
                        ],
                        [
                            "09:15:07",
                            156
                        ],
                        [
                            "09:20:07",
                            148
                        ],
                        [
                            "09:25:08",
                            155
                        ],
                        [
                            "09:30:07",
                            157
                        ],
                        [
                            "09:35:06",
                            155
                        ],
                        [
                            "09:40:06",
                            153
                        ],
                        [
                            "09:45:08",
                            151
                        ],
                        [
                            "09:50:08",
                            138
                        ],
                        [
                            "09:55:10",
                            138
                        ],
                        [
                            "10:00:08",
                            135
                        ],
                        [
                            "10:05:08",
                            134
                        ],
                        [
                            "10:10:09",
                            133
                        ],
                        [
                            "10:15:10",
                            125
                        ],
                        [
                            "10:20:11",
                            128
                        ],
                        [
                            "10:25:11",
                            137
                        ],
                        [
                            "10:30:11",
                            141
                        ],
                        [
                            "10:35:11",
                            136
                        ],
                        [
                            "10:40:11",
                            139
                        ],
                        [
                            "10:45:10",
                            143
                        ],
                        [
                            "10:50:10",
                            149
                        ],
                        [
                            "10:55:14",
                            139
                        ],
                        [
                            "11:00:11",
                            0
                        ],
                        [
                            "11:05:24",
                            146
                        ],
                        [
                            "11:10:09",
                            129
                        ],
                        [
                            "11:15:10",
                            129
                        ],
                        [
                            "11:20:10",
                            138
                        ],
                        [
                            "11:25:12",
                            137
                        ],
                        [
                            "11:30:12",
                            136
                        ],
                        [
                            "11:35:10",
                            132
                        ],
                        [
                            "11:40:12",
                            137
                        ],
                        [
                            "11:45:11",
                            131
                        ],
                        [
                            "11:50:17",
                            141
                        ],
                        [
                            "11:55:10",
                            139
                        ],
                        [
                            "12:00:10",
                            135
                        ],
                        [
                            "12:05:13",
                            131
                        ],
                        [
                            "12:10:11",
                            128
                        ],
                        [
                            "12:15:14",
                            120
                        ],
                        [
                            "12:20:11",
                            121
                        ],
                        [
                            "12:25:17",
                            124
                        ],
                        [
                            "12:30:10",
                            121
                        ],
                        [
                            "12:35:11",
                            125
                        ],
                        [
                            "12:40:15",
                            125
                        ],
                        [
                            "12:45:14",
                            125
                        ],
                        [
                            "12:50:12",
                            126
                        ],
                        [
                            "12:55:07",
                            126
                        ]
                    ]
                },
                {
                    "name": "بیش از 3 درصد مثبت",
                    "data": [
                        [
                            "09:05:07",
                            58
                        ],
                        [
                            "09:10:07",
                            62
                        ],
                        [
                            "09:15:07",
                            64
                        ],
                        [
                            "09:20:07",
                            71
                        ],
                        [
                            "09:25:08",
                            72
                        ],
                        [
                            "09:30:07",
                            79
                        ],
                        [
                            "09:35:06",
                            83
                        ],
                        [
                            "09:40:06",
                            89
                        ],
                        [
                            "09:45:08",
                            87
                        ],
                        [
                            "09:50:08",
                            87
                        ],
                        [
                            "09:55:10",
                            93
                        ],
                        [
                            "10:00:08",
                            96
                        ],
                        [
                            "10:05:08",
                            98
                        ],
                        [
                            "10:10:09",
                            100
                        ],
                        [
                            "10:15:10",
                            101
                        ],
                        [
                            "10:20:11",
                            107
                        ],
                        [
                            "10:25:11",
                            102
                        ],
                        [
                            "10:30:11",
                            101
                        ],
                        [
                            "10:35:11",
                            105
                        ],
                        [
                            "10:40:11",
                            108
                        ],
                        [
                            "10:45:10",
                            108
                        ],
                        [
                            "10:50:10",
                            105
                        ],
                        [
                            "10:55:14",
                            106
                        ],
                        [
                            "11:00:11",
                            0
                        ],
                        [
                            "11:05:24",
                            105
                        ],
                        [
                            "11:10:09",
                            106
                        ],
                        [
                            "11:15:10",
                            109
                        ],
                        [
                            "11:20:10",
                            109
                        ],
                        [
                            "11:25:12",
                            109
                        ],
                        [
                            "11:30:12",
                            112
                        ],
                        [
                            "11:35:10",
                            113
                        ],
                        [
                            "11:40:12",
                            113
                        ],
                        [
                            "11:45:11",
                            114
                        ],
                        [
                            "11:50:17",
                            110
                        ],
                        [
                            "11:55:10",
                            116
                        ],
                        [
                            "12:00:10",
                            113
                        ],
                        [
                            "12:05:13",
                            118
                        ],
                        [
                            "12:10:11",
                            120
                        ],
                        [
                            "12:15:14",
                            123
                        ],
                        [
                            "12:20:11",
                            121
                        ],
                        [
                            "12:25:17",
                            123
                        ],
                        [
                            "12:30:10",
                            128
                        ],
                        [
                            "12:35:11",
                            127
                        ],
                        [
                            "12:40:15",
                            127
                        ],
                        [
                            "12:45:14",
                            127
                        ],
                        [
                            "12:50:12",
                            127
                        ],
                        [
                            "12:55:07",
                            127
                        ]
                    ]
                }
            ]
        ];
        const options= {
          chart: {
            type: 'area',
            height: 350,
            stacked: true,
            stackType: '100%',
            events: {
              selection: function (chart, e) {
                console.log(new Date(e.xaxis.min))
              }
            },
          },
          colors: ['#fc0307', '#fc8b8b', '#bedbad', '#00bd2b', '#45ff6f'],
          dataLabels: {
            enabled: false
          },
          stroke: {
            curve: 'smooth'
          },
          fill: {
            type: 'gradient',
            gradient: {
              opacityFrom: 0.6,
              opacityTo: 0.8,
            }
          },
          legend: {
            show:'false',
            position: 'bottom',
            horizontalAlign: 'center'
          },
          xaxis: {
            type: 'category',
            category:time,
            labels: {
                show: true,
                align: 0,
                }
            },
          yaxis: {
            show: true,
            labels: {
                show: true,
                align: 'center',
            }
          }
        };
      

    return(
        <div style={{width:"100%",display:"flex",justifyContent:"center"}}>
            <button onClick={()=>console.log(series)}>clocl</button>
          <ReactApexChart options={options} series={series} type="area" height={350} width={1250} />
        </div>
    )
}
export default MarketArray;



// import React from 'react';
// import {
//   Chart,
//   Area,
//   Line,
//   Tooltip,
//   Axis,
//   Legend,
//   Coordinate
// } from 'bizcharts';
// import DataSet from '@antv/data-set';

// export default function MarketArray ({MarketArrayData}) {
  
//   const data = [
//     { country: 'بیشتر از 3 درصد منفی', year: '1750', value: 502 },
//     { country: 'بیشتر از 3 درصد منفی', year: '1850', value: 809 },
//     { country: 'بیشتر از 3 درصد منفی', year: '1900', value: 5268 },
//     { country: 'بیشتر از 3 درصد منفی', year: '1950', value: 4400 },
//     { country: 'بیشتر از 3 درصد منفی', year: '1999', value: 3634 },
//     { country: 'بیشتر از 3 درصد منفی', year: '2050', value: 947 },
//     { country: 'بین 0.5 تا 3 درصد منفی', year: '1750', value: 106 },
//     { country: 'بین 0.5 تا 3 درصد منفی', year: '1800', value: 107 },
//     { country: 'بین 0.5 تا 3 درصد منفی', year: '1850', value: 111 },
//     { country: 'بین 0.5 تا 3 درصد منفی', year: '1900', value: 1766 },
//     { country: 'بین 0.5 تا 3 درصد منفی', year: '1950', value: 221 },
//     { country: 'بین 0.5 تا 3 درصد منفی', year: '1999', value: 767 },
//     { country: 'بین 0.5 تا 3 درصد منفی', year: '2050', value: 133 },
//     { country: 'بین منفی 0.5 تا مثبت 0.5', year: '1750', value: 163 },
//     { country: 'بین منفی 0.5 تا مثبت 0.5', year: '1800', value: 203 },
//     { country: 'بین منفی 0.5 تا مثبت 0.5', year: '1850', value: 276 },
//     { country: 'بین منفی 0.5 تا مثبت 0.5', year: '1900', value: 628 },
//     { country: 'بین منفی 0.5 تا مثبت 0.5', year: '1950', value: 547 },
//     { country: 'بین منفی 0.5 تا مثبت 0.5', year: '1999', value: 729 },
//     { country: 'بین منفی 0.5 تا مثبت 0.5', year: '2050', value: 408 },
//     { country: 'بین 0.5 تا 3 درصد مثبت', year: '1750', value: 200 },
//     { country: 'بین 0.5 تا 3 درصد مثبت', year: '1800', value: 200 },
//     { country: 'بین 0.5 تا 3 درصد مثبت', year: '1850', value: 200 },
//     { country: 'بین 0.5 تا 3 درصد مثبت', year: '1900', value: 460 },
//     { country: 'بین 0.5 تا 3 درصد مثبت', year: '1950', value: 230 },
//     { country: 'بین 0.5 تا 3 درصد مثبت', year: '1999', value: 300 },
//     { country: 'بین 0.5 تا 3 درصد مثبت', year: '2050', value: 300 },
//     { country: 'بیش از 3 درصد مثبت', year: '1750', value: 220 },
//     { country: 'بیش از 3 درصد مثبت', year: '1800', value: 225 },
//     { country: 'بیش از 3 درصد مثبت', year: '1850', value: 280 },
//     { country: 'بیش از 3 درصد مثبت', year: '1900', value: 628 },
//     { country: 'بیش از 3 درصد مثبت', year: '1950', value: 547 },
//     { country: 'بیش از 3 درصد مثبت', year: '1999', value: 729 },
//     { country: 'بیش از 3 درصد مثبت', year: '2050', value: 408 },
//   ];
  
//   // 计算百分比
//   const dv = new DataSet.DataView().source(MarketArrayData);
//   dv.transform({
//     type: 'percent',
//     field: 'value',
//     dimension: 'country',
//     groupBy: ['year'],
//     as: 'percent',
//   });
  
//   const scale = {
//     percent: {
//       formatter: (value) => {
//         value = +value || 0;
//         value = +value * 100;
//         return `${value.toFixed(2)}%`;
//       },
//       alias: 'percent(%)',
//     },
//     year: {
//       type: 'linear',
//       tickInterval: 50,
//     },
//   };

  
//   return (
//     <Chart scale={scale} height={400} data={dv.rows} autoFit>
//       <Tooltip shared/>
//       <Area 
//         adjust="stack" 
//         color={
//             ['country', (xVal) => {
//                 if (xVal === 'بیشتر از 3 درصد منفی') {
//                   return '#fc0307';
//                 }else if(xVal === 'بین 0.5 تا 3 درصد منفی'){
//                     return '#fc8b8b';
//                 }else if(xVal === 'بین منفی 0.5 تا مثبت 0.5'){
//                     return '#bedbad';
//                 }else if(xVal === 'بین 0.5 تا 3 درصد مثبت'){
//                     return '#00bd2b';
//                 }else if(xVal === 'بیش از 3 درصد مثبت'){
//                     return '#45ff6f';
//                 }
//               }]
//         }
//         position="year*percent"
            
//     />
//       <Line adjust="stack" color=
//       {
//         ['country', (xVal) => {
//             if (xVal === 'بیشتر از 3 درصد منفی') {
//               return '#fc0307';
//             }else if(xVal === 'بین 0.5 تا 3 درصد منفی'){
//                 return '#fc8b8b';
//             }else if(xVal === 'بین منفی 0.5 تا مثبت 0.5'){
//                 return '#bedbad';
//             }else if(xVal === 'بین 0.5 تا 3 درصد مثبت'){
//                 return '#1eff00';
//             }else if(xVal === 'بیش از 3 درصد مثبت'){
//                 return '#b8ffc8';
//             }
//           }]
//     }
//       position="year*percent" />
//     <Legend
//         layout="vertical"
// 		visible={false}
//     />
//     </Chart>
//   );
// }